Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL020.atdf
         <register caption="" name="CLC2GLS" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="G1D1N" />
            <bitfield caption="" mask="0x00000002" name="G1D1T" />
            <bitfield caption="" mask="0x00000004" name="G1D2N" />
            <bitfield caption="" mask="0x00000008" name="G1D2T" />
            <bitfield caption="" mask="0x00000010" name="G1D3N" />
            <bitfield caption="" mask="0x00000020" name="G1D3T" />
            <bitfield caption="" mask="0x00000040" name="G1D4N" />
            <bitfield caption="" mask="0x00000080" name="G1D4T" />
            <bitfield caption="" mask="0x00000100" name="G2D1N" />
            <bitfield caption="" mask="0x00000200" name="G2D1T" />
            <bitfield caption="" mask="0x00000400" name="G2D2N" />
            <bitfield caption="" mask="0x00000800" name="G2D2T" />
            <bitfield caption="" mask="0x00001000" name="G2D3N" />
            <bitfield caption="" mask="0x00002000" name="G2D3T" />
            <bitfield caption="" mask="0x00004000" name="G2D4N" />
            <bitfield caption="" mask="0x00008000" name="G2D4T" />
            <bitfield caption="" mask="0x00010000" name="G3D1N" />
            <bitfield caption="" mask="0x00020000" name="G3D1T" />
            <bitfield caption="" mask="0x00040000" name="G3D2N" />
            <bitfield caption="" mask="0x00080000" name="G3D2T" />
            <bitfield caption="" mask="0x00100000" name="G3D3N" />
            <bitfield caption="" mask="0x00200000" name="G3D3T" />
            <bitfield caption="" mask="0x00400000" name="G3D4N" />
            <bitfield caption="" mask="0x00800000" name="G3D4T" />
            <bitfield caption="" mask="0x01000000" name="G4D1N" />
            <bitfield caption="" mask="0x02000000" name="G4D1T" />
            <bitfield caption="" mask="0x04000000" name="G4D2N" />
            <bitfield caption="" mask="0x08000000" name="G4D2T" />
            <bitfield caption="" mask="0x10000000" name="G4D3N" />
            <bitfield caption="" mask="0x20000000" name="G4D3T" />
            <bitfield caption="" mask="0x40000000" name="G4D4N" />
            <bitfield caption="" mask="0x80000000" name="G4D4T" />
         </register>
      </register-group>
      <value-group caption="CLCx Mode bits" name="CLC1CON__MODE">
         <value caption="Cell is a 1-input transparent latch with S and R" name="" value="0x7" />
         <value caption="Cell is a JK flip-flop with R" name="" value="0x6" />
         <value caption="Cell is a 2-input D flip-flop with R" name="" value="0x5" />
         <value caption="Cell is a 1-input D flip-flop with S and R" name="" value="0x4" />
         <value caption="Cell is an SR latch" name="" value="0x3" />
         <value caption="Cell is a 4-input AND" name="" value="0x2" />
         <value caption="Cell is an OR-XOR" name="" value="0x1" />
         <value caption="Cell is a AND-OR" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Output Polarity Control bit" name="CLC1CON__LCPOL">
         <value caption="The output of the module is inverted" name="" value="0x1" />
         <value caption="The output of the module is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Data Output Status bit" name="CLC1CON__LCOUT">
         <value caption="CLCx output high" name="" value="0x1" />
         <value caption="CLCx output low" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Port Enable bit" name="CLC1CON__LCOE">
         <value caption="CLCx port pin output is enabled" name="" value="0x1" />
         <value caption="CLCx port pin output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Negative Edge Interrupt Enable bit" name="CLC1CON__INTN">
         <value caption="Interrupt will be generated when a falling edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Positive Edge Interrupt Enable bit" name="CLC1CON__INTP">
         <value caption="Interrupt will be generated when a rising edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Enable bit" name="CLC1CON__ON">
         <value caption="CLCx is enabled and mixing input signals" name="" value="0x1" />
         <value caption="CLCx is disabled and has logic zero outputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Polarity Control bit" name="CLC1CON__G1POL">
         <value caption="The output of Channel 1 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 1 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Polarity Control bit" name="CLC1CON__G2POL">
         <value caption="The output of Channel 2 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 2 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Polarity Control bit" name="CLC1CON__G3POL">
         <value caption="The output of Channel 3 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 3 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Polarity Control bit" name="CLC1CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Mode bits" name="CLC2CON__MODE">
         <value caption="Cell is a 1-input transparent latch with S and R" name="" value="0x7" />
         <value caption="Cell is a JK flip-flop with R" name="" value="0x6" />
         <value caption="Cell is a 2-input D flip-flop with R" name="" value="0x5" />
         <value caption="Cell is a 1-input D flip-flop with S and R" name="" value="0x4" />
         <value caption="Cell is an SR latch" name="" value="0x3" />
         <value caption="Cell is a 4-input AND" name="" value="0x2" />
         <value caption="Cell is an OR-XOR" name="" value="0x1" />
         <value caption="Cell is a AND-OR" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Output Polarity Control bit" name="CLC2CON__LCPOL">
         <value caption="The output of the module is inverted" name="" value="0x1" />
         <value caption="The output of the module is not inverted" name="" value="0x0" />
      </value-group>
