Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL020.atdf
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC2SEL__DS3">
         <value caption="SCCP3 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP2 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP2 OCM2 output" name="" value="0x5" />
         <value caption="UART2 RX In" name="" value="0x4" />
         <value caption="SPI2 SDO2 Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC2 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC2SEL__DS4">
         <value caption="SCCP3 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="SPI2 SDI2 in" name="" value="0x3" />
         <value caption="SCCP3 OCM3 Output" name="" value="0x2" />
         <value caption="CLC1 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01427" name="CMP" version="">
      <register-group name="CMP">
         <register caption="" name="CMSTAT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Comparator 1 Output bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Comparator 2 Output bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Comparator Reference Voltage Select (CVREFSEL)" mask="0x00000100" name="CVREFSEL" values="CMSTAT__CVREFSEL" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
            <bitfield caption="" mask="0x00010000" name="C1EVT" />
            <bitfield caption="" mask="0x00020000" name="C2EVT" />
         </register>
         <register caption="" name="CM1CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Configuration" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Comparator Positive Input Configuration" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield caption="" mask="0x00000200" name="CEVT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
         </register>
         <register caption="" name="CM2CON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Configuration" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Comparator Positive Input Configuration" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield caption="" mask="0x00000200" name="CEVT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
         </register>
      </register-group>
      <value-group caption="Comparator 1 Output bit" name="CMSTAT__C1OUT">
         <value caption="Output of Comparator 1 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 1 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 2 Output bit" name="CMSTAT__C2OUT">
         <value caption="Output of Comparator 2 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 2 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Reference Voltage Select (CVREFSEL)" name="CMSTAT__CVREFSEL">
         <value caption="External voltage reference from the CVREF+ pin is selected" name="" value="0x1" />
         <value caption="Internal band gap voltage reference is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CMSTAT__SIDL">
         <value caption="All Comparator modules are disabled in Idle mode" name="" value="0x1" />
         <value caption="All Comparator modules continue to operate in the Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Configuration" name="CM1CON__CCH">
         <value caption="Comparator inverting input is connected to the band gap reference voltage" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configuration" name="CM1CON__CREF">
         <value caption="Comparator Non-inverting input connects to the reference defined by the CVREFSEL bit" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Comparator event is generated on any change of the comparator output" name="" value="0x3" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 0) or low-to-high transition (if CPOL = 1) of the comparator output" name="" value="0x2" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 1) or low-to-high transition (if CPOL = 0) of the comparator output" name="" value="0x1" />
         <value caption="Comparator event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="VIN+ is greater than VIN- (if CPOL = 0)/VIN+ is smaller than VIN- (if CPOL = 1)" name="" value="0x1" />
         <value caption="VIN+ is greater than VIN- (if CPOL = 1)/VIN+ is smaller than VIN- (if CPOL = 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM1CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM1CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Configuration" name="CM2CON__CCH">
         <value caption="Comparator inverting input is connected to the band gap reference voltage" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configuration" name="CM2CON__CREF">
         <value caption="Comparator Non-inverting input connects to the reference defined by the CVREFSEL bit" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM2CON__EVPOL">
         <value caption="Comparator event is generated on any change of the comparator output" name="" value="0x3" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 0) or low-to-high transition (if CPOL = 1) of the comparator output" name="" value="0x2" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 1) or low-to-high transition (if CPOL = 0) of the comparator output" name="" value="0x1" />
         <value caption="Comparator event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM2CON__COUT">
         <value caption="VIN+ is greater than VIN- (if CPOL = 0)/VIN+ is smaller than VIN- (if CPOL = 1)" name="" value="0x1" />
         <value caption="VIN+ is greater than VIN- (if CPOL = 1)/VIN+ is smaller than VIN- (if CPOL = 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM2CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
